tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

# Better versions of Mac built-ins
brew "bash"
brew "bash-completion@2"
brew "colordiff"
brew "gnu-sed", args: ["with-default-names"]
brew "rsync"
brew "the_silver_searcher"

# Bash completions
brew "brew-cask-completion"
brew "django-completion"
brew "docker-completion"
brew "docker-compose-completion"
brew "pip-completion"
brew "yarn-completion"

# General development
tap "universal-ctags/universal-ctags"
brew "automake"
brew "ctop"
brew "git"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]

# Node
brew "node@10"

# node-canvas
brew "cairo"
brew "giflib"
brew "jpeg"
brew "libpng"
brew "pango"
brew "pkg-config"

# React develoment (jest)
brew "watchman"

# Python development
brew "gdbm"
brew "pyenv"
brew "pyenv-virtualenvwrapper"

# pyenv recommended
brew "readline"
brew "sqlite"
brew "xz"
brew "zlib"

# Ruby development
brew "chruby"
brew "libyaml"
brew "ruby-install"

# Needed for magic
brew "libmagic"

# More nice-to-haves and various development libraries
brew "autojump"
brew "direnv"
brew "dos2unix"
brew "exa"
brew "httpie"
brew "jq"
brew "macvim", args: ["with-override-system-vim"]
brew "mas"
brew "multimarkdown"
brew "openssl"
brew "pandoc"
brew "qpdf"
brew "shellcheck"
brew "sleepwatcher", restart_service: true
brew "speedtest-cli"
brew "ssh-copy-id"
brew "sslmate"
brew "swig"
brew "tmate"
brew "tmux"
brew "trash"
brew "tree"
brew "wdiff"
brew "wget"

# tmux copy and paste
brew "reattach-to-user-namespace"

# Quick Look plugins
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "webpquicklook"

# Apps
cask "alfred"
cask "appcleaner"
cask "bartender"
cask "busycal"
cask "diskmaker-x"
cask "docker"
cask "dropbox"
cask "fastscripts"
cask "firefox"
cask "fluid"
cask "google-chrome"
cask "java"
cask "keepingyouawake"
cask "nvalt"
cask "onyx"
cask "pester"
cask "sketch"
cask "skype"
cask "slack"
cask "soundsource"
cask "sourcetree"
cask "taskpaper"
cask "whatsapp"

# Color calibration
brew "argyll-cms"
cask "displaycal"

# PrefPanes
cask "functionflip"
cask "rcdefaultapp"

# Veelo
tap "getsentry/tools"
tap "heroku/brew"
brew "awscli"
brew "heroku"
brew "heroku-node"
brew "libmemcached"
brew "libxmlsec1"
brew "sentry-cli"
cask "chromedriver"
cask "virtualbox"
cask "zeplin"
cask "zoomus"
cask "zulip"

mas "1Password", id: 443987910
mas "Backdrop", id: 411461952
mas "Byword", id: 420212497
mas "ColorSnapper", id: 418176775
mas "Contacts Sync For Google Gmail", id: 451691288
mas "Day One Classic", id: 422304217
mas "Deliveries", id: 924726344
mas "EasyFind", id: 411673888
mas "Evernote", id: 406056744
mas "Gemini", id: 463541543
mas "Icon Slate", id: 439697913
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "LimeChat", id: 414030210
mas "Logitech Camera Settings", id: 638332853
mas "Logoist 2", id: 905654078
mas "MDB ACCDB Viewer", id: 417392270
mas "Mactracker", id: 430255202
mas "MindNode", id: 992076693
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paprika Recipe Manager", id: 451907568
mas "Patterns", id: 429449079
mas "Pixelmator", id: 407963104
mas "Pocket", id: 568494494
mas "Reeder", id: 880001334
mas "Scapple", id: 568020055
mas "Skitch", id: 425955336
mas "Stockfish", id: 801463932
mas "The Unarchiver", id: 425424353
mas "Trello", id: 1278508951
mas "Tweetbot", id: 557168941
mas "Xcode", id: 497799835
