tap "caskroom/cask"
tap "caskroom/drivers"
tap "caskroom/eid"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"

# Homebrew utils
tap "vitorgalvao/tiny-scripts"
brew "vitorgalvao/tiny-scripts/cask-repair"

# Better versions of Mac built-ins
brew "bash"
brew "bash-completion@2"
brew "colordiff"
brew "gnu-sed", args: ["with-default-names"]
brew "rsync"
brew "the_silver_searcher"

# Bash completions
brew "brew-cask-completion"
brew "django-completion"
brew "docker-completion"
brew "docker-compose-completion"
brew "pip-completion"

# General development
tap "universal-ctags/universal-ctags"
brew "automake"
brew "git"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]

# Needed for Python development
brew "gdbm"
brew "pipenv"
brew "pyenv"

# Needed for magic
brew "libmagic"

# Needed for Ruby development
brew "chruby"
brew "libyaml"
brew "ruby-install"

# More nice-to-haves and various development libraries
brew "dos2unix"
brew "macvim", args: ["with-override-system-vim"]
brew "multimarkdown"
brew "nave"
brew "openssl"
brew "pandoc"
brew "qpdf"
brew "shellcheck"
brew "sleepwatcher", restart_service: true
brew "speedtest-cli"
brew "ssh-copy-id"
brew "sslmate"
brew "swig"
brew "tmate"
brew "tmux"
brew "trash"
brew "tree"
brew "wdiff"
brew "wget"

# tmux copy and paste
brew "reattach-to-user-namespace"

# Veelo development
brew "awscli"
brew "heroku"

# Quick Look plugins
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "webpquicklook"

# Apps
cask "etrecheck"
cask "fluid"
cask "keepingyouawake"
cask "namebench"
cask "private-eye"

# PrefPanes
cask "functionflip"
cask "rcdefaultapp"

cask "java"
